
## Plan Result (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/39439)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Update
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod:327" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:cd6201dbaa92c4178a1f214c8c19e0baa072d7dc" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:d9be05d5c82ed75d676fd63c657030cc7a242bcb"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ShareableListsApi-Prod" -> (known after apply)
      ~ revision                 = 327 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B will be updated in-place
  ~ resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_query_0_99E4AE1B" {
        id                       = "slapi-prod-query-0"
        name                     = "slapi-prod-query-0"
      ~ runtime_version          = "syn-nodejs-puppeteer-4.0" -> "syn-nodejs-puppeteer-6.2"
        tags                     = {}
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB will be updated in-place
  ~ resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_uptime_0_4168D0DB" {
        id                       = "slapi-prod-uptime-0"
        name                     = "slapi-prod-uptime-0"
      ~ runtime_version          = "syn-nodejs-puppeteer-4.0" -> "syn-nodejs-puppeteer-6.2"
        tags                     = {}
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"088e7d65-af5a-48d1-be4c-02de0e723e59","JobName":"shareable-lists-api_infrastructure_plan_prod","PRNumber":152,"Program":"tfcmt","SHA1":"d9be05d5c82ed75d676fd63c657030cc7a242bcb","Target":"shareable-lists-api-cdk","Vars":{}} -->